<a href="https://colab.research.google.com/github/KomalMano/Story/blob/master/5_Median%2C_Mean%2C_Mode%2C_Percentile.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
from google.colab import files
import numpy as np
import io

In [2]:
uploaded = files.upload()

Saving income.csv to income.csv

In [3]:
for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

User uploaded file "income.csv" with length 112 bytes

In [4]:
uploaded

{'income.csv': b'Name,Monthly Income ($)\r\nRob,5000\r\nRafiq,6000\r\nNina,4000\r\nSofia,7500\r\nMohan,8000\r\nTao,7000\r\nElon Musk,10000000\r\n'}

In [5]:
df = pd.read_csv(io.StringIO(uploaded['income.csv'].decode('utf-8')))
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [6]:
df = pd.read_csv(io.StringIO(uploaded['income.csv'].decode('utf-8')), names=["name","income"], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [7]:
#this will give u basic statistic of data state
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [8]:
df.income.quantile(0.75)

7750.0

In [10]:
df.income.quantile(0.25, interpolation="lower")

5000

In [12]:
df.income.quantile(0)

4000.0

In [13]:
df.income.quantile(1)

10000000.0

In [14]:
df.income.quantile(0.99)

9400479.999999994

In [15]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [17]:
#its an outlier
df[df.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [18]:
df_no_outlier = df[df.income<=percentile_99]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [19]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [23]:
df['income'][3]=np.NaN

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [24]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [25]:
#sometimes data is not transmission
df.income.mean()

1671666.6666666667

In [26]:
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [27]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0